IDEA StatiCa Open Model
SteelSetupIND Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Steel setup IND class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupIND
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SteelSetupIND : SteelSetup
Public Class SteelSetupIND
	Inherits SteelSetup
public ref class SteelSetupIND : public SteelSetup
The SteelSetupIND type exposes the following members.
Constructors
Name | Description
SteelSetupIND
Initializes a new instance of the SteelSetupIND class
Top
Properties
Name | Description
GammaM0
 Partial safety factor for resistance governed by yielding
GammaM1
 Partial safety factor for resistance governed by ultimate stress
GammaMb
 Partial safety factor for bolts - bearing type
GammaMf
 Partial safety factor for bolts - friction type
GammaMw
 Partial safety factor for welds
Top
Methods
Name | Description
FrictionCoefficientPboltDefault
 Friction Coefficient Pbolt Default
 (Overrides SteelSetup.FrictionCoefficientPboltDefault().)
Top
See Also
Reference
IdeaRS.OpenModel Namespace